import { useRef } from "react";

interface StepType {
  type: string;
}

const Step02 = ({ type }: StepType) => {
  const fileRef = useRef<HTMLInputElement>(null);

  const onClickHandler = () => {
    if (!fileRef.current) return;
    fileRef.current.click();
  };

  return (
    <section className="px-4">
      <h4 className="mt-6 text-center text-2xl font-semibold leading-9 tracking-tight">
        {type === "daengju" ? "댕주" : "댕친"}로 가입하기
      </h4>
      <div
        onClick={onClickHandler}
        className="mx-auto mt-4 flex size-[164px] cursor-pointer flex-col items-center justify-center rounded-full bg-[#D9D9D9] leading-6 tracking-tight text-grayscale-gray2"
      >
        사진 추가하기
        <svg
          className="mt-[5px]"
          width="17"
          height="16"
          viewBox="0 0 17 16"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M6.47857 5.44382L7.6999 4.21685V9.33279C7.6999 9.47428 7.75609 9.60997 7.85611 9.71001C7.95613 9.81005 8.09179 9.86626 8.23324 9.86626C8.37468 9.86626 8.51034 9.81005 8.61036 9.71001C8.71038 9.60997 8.76657 9.47428 8.76657 9.33279V4.21685L9.9879 5.44382C10.0375 5.49382 10.0965 5.53351 10.1615 5.56059C10.2265 5.58768 10.2962 5.60162 10.3666 5.60162C10.437 5.60162 10.5067 5.58768 10.5717 5.56059C10.6367 5.53351 10.6957 5.49382 10.7452 5.44382C10.7952 5.39423 10.8349 5.33523 10.862 5.27022C10.8891 5.20521 10.903 5.13549 10.903 5.06506C10.903 4.99464 10.8891 4.92491 10.862 4.8599C10.8349 4.7949 10.7952 4.73589 10.7452 4.6863L8.6119 2.55244C8.56118 2.50387 8.50137 2.4658 8.4359 2.44041C8.30606 2.38705 8.16041 2.38705 8.03057 2.44041C7.9651 2.4658 7.90529 2.50387 7.85457 2.55244L5.72124 4.6863C5.67151 4.73604 5.63206 4.79509 5.60515 4.86008C5.57824 4.92507 5.56439 4.99472 5.56439 5.06506C5.56439 5.1354 5.57824 5.20506 5.60515 5.27005C5.63206 5.33503 5.67151 5.39408 5.72124 5.44382C5.77096 5.49356 5.83 5.53302 5.89497 5.55994C5.95994 5.58686 6.02958 5.60071 6.0999 5.60071C6.17023 5.60071 6.23986 5.58686 6.30484 5.55994C6.36981 5.53302 6.42884 5.49356 6.47857 5.44382ZM13.0332 7.73239C12.8918 7.73239 12.7561 7.7886 12.6561 7.88864C12.5561 7.98869 12.4999 8.12438 12.4999 8.26586V11.4667C12.4999 11.6081 12.4437 11.7438 12.3437 11.8439C12.2437 11.9439 12.108 12.0001 11.9666 12.0001H4.4999C4.35845 12.0001 4.2228 11.9439 4.12278 11.8439C4.02276 11.7438 3.96657 11.6081 3.96657 11.4667V8.26586C3.96657 8.12438 3.91038 7.98869 3.81036 7.88864C3.71034 7.7886 3.57468 7.73239 3.43324 7.73239C3.29179 7.73239 3.15613 7.7886 3.05611 7.88864C2.95609 7.98869 2.8999 8.12438 2.8999 8.26586V11.4667C2.8999 11.8911 3.06847 12.2982 3.36853 12.5983C3.66859 12.8984 4.07556 13.0671 4.4999 13.0671H11.9666C12.3909 13.0671 12.7979 12.8984 13.0979 12.5983C13.398 12.2982 13.5666 11.8911 13.5666 11.4667V8.26586C13.5666 8.12438 13.5104 7.98869 13.4104 7.88864C13.3103 7.7886 13.1747 7.73239 13.0332 7.73239Z"
            fill="#666666"
          />
        </svg>
        <input ref={fileRef} type="file" className="hidden" />
      </div>

      <div className="mt-[41px]">
        <label htmlFor="" className="font-semibold leading-6 tracking-tight">
          닉네임*
        </label>
        <div className="relative">
          <input
            className="mt-1 block h-10 w-full rounded-[10px] border px-2"
            type="text"
            placeholder="닉네임을 입력해주세요"
          />
          <svg
            className="absolute right-2 top-1/2 -translate-y-1/2"
            width="16"
            height="16"
            viewBox="0 0 16 16"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M2 7.42857L5.53203 11.9137C5.56849 11.96 5.63688 11.9649 5.67956 11.9242L14 4"
              stroke="#67A22C"
              stroke-width="2"
              stroke-linecap="round"
            />
          </svg>
        </div>
      </div>
    </section>
  );
};

export default Step02;
